Evaluations/adaptivePerf_TPDS_revision/data/output_2025_Oct_09_1050.txt
Running 20m test @ http://nginx-thrift.social-network3.svc.cluster.local:8080/wrk2-api/post/compose
  8 threads and 100 connections

  Thread calibration: mean lat.: 68.344ms, rate sampling interval: 44ms
  Thread calibration: mean lat.: 12.056ms, rate sampling interval: 31ms
  Thread calibration: mean lat.: 84.127ms, rate sampling interval: 710ms
  Thread calibration: mean lat.: 74.845ms, rate sampling interval: 605ms
  Thread calibration: mean lat.: 31.719ms, rate sampling interval: 30ms
  Thread calibration: mean lat.: 49.143ms, rate sampling interval: 34ms
  Thread calibration: mean lat.: 11.681ms, rate sampling interval: 29ms
  Thread calibration: mean lat.: 327.549ms, rate sampling interval: 1574ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network3.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   101.93ms  107.13ms 417.54ms   83.80%
    Req/Sec     5.91     13.33    60.00     82.69%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   37.69ms
 75.000%  168.83ms
 90.000%  250.49ms
 99.000%  417.54ms
 99.900%  790.53ms
 99.990%    1.34s 
 99.999%    1.81s 
100.000%    1.89s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.383     0.000000            1         1.00
      10.407     0.100000         5492         1.11
      12.631     0.200000        10950         1.25
      31.391     0.300000        16448         1.43
      33.183     0.400000        21900         1.67
      37.695     0.500000        27365         2.00
      39.327     0.550000        30117         2.22
     164.735     0.600000        32821         2.50
     167.295     0.650000        35793         2.86
     168.063     0.700000        38546         3.33
     168.831     0.750000        41121         4.00
     169.471     0.775000        42660         4.44
     170.239     0.800000        43800         5.00
     179.455     0.825000        45131         5.71
     248.063     0.850000        46515         6.67
     249.727     0.875000        47964         8.00
     250.111     0.887500        48601         8.89
     250.495     0.900000        49285        10.00
     251.007     0.912500        50027        11.43
     251.519     0.925000        50646        13.33
     252.543     0.937500        51356        16.00
     253.567     0.943750        51653        17.78
     256.127     0.950000        51972        20.00
     265.727     0.956250        52310        22.86
     285.951     0.962500        52650        26.67
     304.895     0.968750        52993        32.00
     315.647     0.971875        53163        35.56
     326.911     0.975000        53332        40.00
     337.151     0.978125        53507        45.71
     347.647     0.981250        53674        53.33
     364.287     0.984375        53845        64.00
     378.111     0.985938        53931        71.11
     389.375     0.987500        54016        80.00
     405.759     0.989062        54101        91.43
     425.983     0.990625        54187       106.67
     448.255     0.992188        54274       128.00
     458.495     0.992969        54317       142.22
     472.063     0.993750        54359       160.00
     482.303     0.994531        54401       182.86
     493.055     0.995313        54443       213.33
     511.743     0.996094        54486       256.00
     526.847     0.996484        54507       284.44
     546.303     0.996875        54530       320.00
     567.295     0.997266        54550       365.71
     593.919     0.997656        54571       426.67
     619.519     0.998047        54593       512.00
     628.223     0.998242        54604       568.89
     665.599     0.998437        54614       640.00
     705.023     0.998633        54625       731.43
     759.807     0.998828        54635       853.33
     797.183     0.999023        54646      1024.00
     821.759     0.999121        54651      1137.78
     858.623     0.999219        54657      1280.00
     882.687     0.999316        54662      1462.86
     930.303     0.999414        54667      1706.67
    1001.471     0.999512        54673      2048.00
    1016.319     0.999561        54675      2275.56
    1062.911     0.999609        54678      2560.00
    1092.607     0.999658        54681      2925.71
    1103.871     0.999707        54683      3413.33
    1124.351     0.999756        54686      4096.00
    1148.927     0.999780        54687      4551.11
    1185.791     0.999805        54689      5120.00
    1187.839     0.999829        54690      5851.43
    1192.959     0.999854        54691      6826.67
    1273.855     0.999878        54693      8192.00
    1273.855     0.999890        54693      9102.22
    1340.415     0.999902        54694     10240.00
    1441.791     0.999915        54695     11702.86
    1441.791     0.999927        54695     13653.33
    1532.927     0.999939        54696     16384.00
    1532.927     0.999945        54696     18204.44
    1562.623     0.999951        54697     20480.00
    1562.623     0.999957        54697     23405.71
    1562.623     0.999963        54697     27306.67
    1813.503     0.999969        54698     32768.00
    1813.503     0.999973        54698     36408.89
    1813.503     0.999976        54698     40960.00
    1813.503     0.999979        54698     46811.43
    1813.503     0.999982        54698     54613.33
    1886.207     0.999985        54699     65536.00
    1886.207     1.000000        54699          inf
#[Mean    =      101.935, StdDeviation   =      107.127]
#[Max     =     1885.184, Total count    =        54699]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  55207 requests in 19.23m, 15.81MB read
  Socket errors: connect 0, read 0, write 0, timeout 20351
  Non-2xx or 3xx responses: 60
Requests/sec:     47.84  
Transfer/sec:     14.03KB