Evaluations/adaptivePerf_TPDS_revision/data/output_2025_Oct_09_1114.txt
Running 20m test @ http://nginx-thrift.social-network3.svc.cluster.local:8080/wrk2-api/post/compose
  8 threads and 100 connections

  Thread calibration: mean lat.: 362.015ms, rate sampling interval: 1192ms
  Thread calibration: mean lat.: 65.412ms, rate sampling interval: 70ms
  Thread calibration: mean lat.: 231.512ms, rate sampling interval: 989ms
  Thread calibration: mean lat.: 54.267ms, rate sampling interval: 27ms
  Thread calibration: mean lat.: 36.307ms, rate sampling interval: 27ms
  Thread calibration: mean lat.: 486.449ms, rate sampling interval: 4661ms
  Thread calibration: mean lat.: 26.759ms, rate sampling interval: 28ms
  Thread calibration: mean lat.: 50.304ms, rate sampling interval: 33ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network3.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   122.26ms  150.85ms 706.56ms   87.13%
    Req/Sec     5.99     14.04    60.00     85.37%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   57.85ms
 75.000%  150.78ms
 90.000%  398.85ms
 99.000%  706.56ms
 99.900%    1.09s 
 99.990%    1.48s 
 99.999%    1.58s 
100.000%    1.65s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.395     0.000000            1         1.00
      10.271     0.100000         5701         1.11
      12.679     0.200000        11384         1.25
      42.303     0.300000        17125         1.43
      56.447     0.400000        22796         1.67
      57.855     0.500000        28562         2.00
      58.783     0.550000        31345         2.22
      68.863     0.600000        34142         2.50
     148.991     0.650000        37047         2.86
     150.015     0.700000        40263         3.33
     150.783     0.750000        42984         4.00
     151.167     0.775000        44102         4.44
     151.935     0.800000        45715         5.00
     153.215     0.825000        46983         5.71
     188.031     0.850000        48365         6.67
     295.679     0.875000        49789         8.00
     398.335     0.887500        50638         8.89
     398.847     0.900000        51283        10.00
     399.359     0.912500        51973        11.43
     399.871     0.925000        52689        13.33
     400.639     0.937500        53538        16.00
     400.895     0.943750        53746        17.78
     401.407     0.950000        54072        20.00
     402.431     0.956250        54451        22.86
     412.415     0.962500        54768        26.67
     467.199     0.968750        55122        32.00
     493.055     0.971875        55302        35.56
     528.383     0.975000        55481        40.00
     557.055     0.978125        55662        45.71
     587.263     0.981250        55835        53.33
     621.055     0.984375        56013        64.00
     647.679     0.985938        56104        71.11
     668.671     0.987500        56190        80.00
     692.735     0.989062        56279        91.43
     717.823     0.990625        56367       106.67
     748.031     0.992188        56457       128.00
     760.319     0.992969        56500       142.22
     771.583     0.993750        56547       160.00
     783.871     0.994531        56591       182.86
     795.647     0.995313        56635       213.33
     832.511     0.996094        56678       256.00
     853.503     0.996484        56701       284.44
     877.567     0.996875        56723       320.00
     912.895     0.997266        56745       365.71
     936.447     0.997656        56767       426.67
     969.215     0.998047        56789       512.00
     986.111     0.998242        56800       568.89
    1017.343     0.998437        56812       640.00
    1043.967     0.998633        56823       731.43
    1065.983     0.998828        56834       853.33
    1088.511     0.999023        56846      1024.00
    1099.775     0.999121        56850      1137.78
    1128.447     0.999219        56856      1280.00
    1145.855     0.999316        56862      1462.86
    1166.335     0.999414        56867      1706.67
    1196.031     0.999512        56873      2048.00
    1207.295     0.999561        56875      2275.56
    1217.535     0.999609        56878      2560.00
    1234.943     0.999658        56881      2925.71
    1292.287     0.999707        56884      3413.33
    1353.727     0.999756        56887      4096.00
    1361.919     0.999780        56888      4551.11
    1370.111     0.999805        56889      5120.00
    1386.495     0.999829        56891      5851.43
    1411.071     0.999854        56892      6826.67
    1477.631     0.999878        56894      8192.00
    1477.631     0.999890        56894      9102.22
    1480.703     0.999902        56895     10240.00
    1499.135     0.999915        56896     11702.86
    1499.135     0.999927        56896     13653.33
    1528.831     0.999939        56897     16384.00
    1528.831     0.999945        56897     18204.44
    1567.743     0.999951        56898     20480.00
    1567.743     0.999957        56898     23405.71
    1567.743     0.999963        56898     27306.67
    1577.983     0.999969        56899     32768.00
    1577.983     0.999973        56899     36408.89
    1577.983     0.999976        56899     40960.00
    1577.983     0.999979        56899     46811.43
    1577.983     0.999982        56899     54613.33
    1653.759     0.999985        56900     65536.00
    1653.759     1.000000        56900          inf
#[Mean    =      122.256, StdDeviation   =      150.854]
#[Max     =     1652.736, Total count    =        56900]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  57427 requests in 20.00m, 16.45MB read
  Socket errors: connect 0, read 0, write 0, timeout 21194
  Non-2xx or 3xx responses: 30
Requests/sec:     47.85  
Transfer/sec:     14.03KB